results/test1/file/d/fio-512.txt
random-write: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
Jobs: 4 (f=4): [w(4)][100.0%][w=2895KiB/s][w=5790 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1099: Sat Mar 16 19:01:11 2024
  write: IOPS=1701, BW=851KiB/s (871kB/s)(49.9MiB/60024msec); 0 zone resets
    slat (nsec): min=431, max=54151k, avg=74911.87, stdev=451312.16
    clat (nsec): min=551, max=810811k, avg=4470810.98, stdev=48046637.46
     lat (usec): min=18, max=810814, avg=4545.72, stdev=48045.87
    clat percentiles (nsec):
     |  1.00th=[     1048],  5.00th=[     4320], 10.00th=[    30848],
     | 20.00th=[   222208], 30.00th=[   317440], 40.00th=[   415744],
     | 50.00th=[   509952], 60.00th=[   643072], 70.00th=[   823296],
     | 80.00th=[  1122304], 90.00th=[  1794048], 95.00th=[  2736128],
     | 99.00th=[ 15925248], 99.50th=[387973120], 99.90th=[734003200],
     | 99.95th=[742391808], 99.99th=[792723456]
   bw (  KiB/s): min=    1, max= 2106, per=31.78%, avg=1030.83, stdev=505.89, samples=99
   iops        : min=    2, max= 4212, avg=2061.85, stdev=1011.76, samples=99
  lat (nsec)   : 750=0.53%, 1000=0.40%
  lat (usec)   : 2=1.67%, 4=2.21%, 10=2.30%, 20=1.69%, 50=2.02%
  lat (usec)   : 100=1.49%, 250=10.87%, 500=25.84%, 750=17.37%, 1000=10.12%
  lat (msec)   : 2=15.09%, 4=5.67%, 10=1.48%, 20=0.34%, 50=0.28%
  lat (msec)   : 100=0.04%, 250=0.01%, 500=0.11%, 750=0.42%, 1000=0.03%
  cpu          : usr=1.92%, sys=31.84%, ctx=211684, majf=0, minf=0
  IO depths    : 1=0.9%, 2=5.8%, 4=54.9%, 8=38.4%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.4%, 8=4.6%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,102111,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1100: Sat Mar 16 19:01:11 2024
  write: IOPS=1528, BW=764KiB/s (783kB/s)(44.8MiB/60024msec); 0 zone resets
    slat (nsec): min=240, max=53820k, avg=71699.35, stdev=420483.72
    clat (nsec): min=541, max=810144k, avg=5014421.62, stdev=50600325.64
     lat (usec): min=19, max=810148, avg=5086.12, stdev=50598.53
    clat percentiles (nsec):
     |  1.00th=[     1464],  5.00th=[     8896], 10.00th=[   201728],
     | 20.00th=[   305152], 30.00th=[   419840], 40.00th=[   497664],
     | 50.00th=[   618496], 60.00th=[   757760], 70.00th=[   962560],
     | 80.00th=[  1302528], 90.00th=[  2039808], 95.00th=[  3096576],
     | 99.00th=[ 20316160], 99.50th=[513802240], 99.90th=[734003200],
     | 99.95th=[742391808], 99.99th=[792723456]
   bw (  KiB/s): min=    1, max= 1528, per=28.57%, avg=926.36, stdev=431.43, samples=99
   iops        : min=    2, max= 3056, avg=1852.86, stdev=862.85, samples=99
  lat (nsec)   : 750=0.22%, 1000=0.24%
  lat (usec)   : 2=1.18%, 4=1.80%, 10=1.82%, 20=1.38%, 50=1.63%
  lat (usec)   : 100=0.41%, 250=6.41%, 500=24.93%, 750=19.55%, 1000=11.90%
  lat (msec)   : 2=18.12%, 4=7.04%, 10=1.98%, 20=0.38%, 50=0.32%
  lat (msec)   : 100=0.04%, 250=0.02%, 500=0.12%, 750=0.47%, 1000=0.04%
  cpu          : usr=1.83%, sys=36.63%, ctx=191312, majf=0, minf=0
  IO depths    : 1=0.6%, 2=5.0%, 4=54.4%, 8=40.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.9%, 8=4.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,91760,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1101: Sat Mar 16 19:01:11 2024
  write: IOPS=1704, BW=852KiB/s (873kB/s)(49.9MiB/60024msec); 0 zone resets
    slat (nsec): min=271, max=48435k, avg=70104.68, stdev=460967.03
    clat (nsec): min=541, max=808714k, avg=4482718.20, stdev=48007749.10
     lat (usec): min=20, max=808726, avg=4552.82, stdev=48007.76
    clat percentiles (nsec):
     |  1.00th=[     1176],  5.00th=[     5536], 10.00th=[    60160],
     | 20.00th=[   228352], 30.00th=[   325632], 40.00th=[   423936],
     | 50.00th=[   518144], 60.00th=[   651264], 70.00th=[   831488],
     | 80.00th=[  1138688], 90.00th=[  1794048], 95.00th=[  2703360],
     | 99.00th=[ 17170432], 99.50th=[387973120], 99.90th=[734003200],
     | 99.95th=[742391808], 99.99th=[792723456]
   bw (  KiB/s): min=    1, max= 2033, per=31.54%, avg=1022.35, stdev=503.97, samples=100
   iops        : min=    2, max= 4066, avg=2044.84, stdev=1007.94, samples=100
  lat (nsec)   : 750=0.36%, 1000=0.35%
  lat (usec)   : 2=1.54%, 4=2.14%, 10=2.00%, 20=1.48%, 50=1.89%
  lat (usec)   : 100=1.61%, 250=11.12%, 500=25.76%, 750=17.74%, 1000=10.27%
  lat (msec)   : 2=15.38%, 4=5.54%, 10=1.57%, 20=0.35%, 50=0.30%
  lat (msec)   : 100=0.04%, 250=0.01%, 500=0.11%, 750=0.42%, 1000=0.03%
  cpu          : usr=1.95%, sys=31.80%, ctx=207641, majf=0, minf=0
  IO depths    : 1=0.8%, 2=5.9%, 4=55.2%, 8=38.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.4%, 8=4.6%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,102297,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1102: Sat Mar 16 19:01:11 2024
  write: IOPS=1547, BW=774KiB/s (792kB/s)(45.3MiB/60024msec); 0 zone resets
    slat (nsec): min=241, max=40998k, avg=68064.29, stdev=311385.39
    clat (nsec): min=521, max=811280k, avg=4975950.67, stdev=50415064.97
     lat (usec): min=19, max=811282, avg=5044.01, stdev=50412.63
    clat percentiles (nsec):
     |  1.00th=[     1160],  5.00th=[     4448], 10.00th=[   110080],
     | 20.00th=[   288768], 30.00th=[   419840], 40.00th=[   501760],
     | 50.00th=[   626688], 60.00th=[   765952], 70.00th=[   978944],
     | 80.00th=[  1318912], 90.00th=[  2072576], 95.00th=[  3096576],
     | 99.00th=[ 19791872], 99.50th=[471859200], 99.90th=[734003200],
     | 99.95th=[742391808], 99.99th=[792723456]
   bw (  KiB/s): min=    1, max= 1687, per=29.22%, avg=947.09, stdev=451.38, samples=98
   iops        : min=    2, max= 3375, avg=1894.30, stdev=902.73, samples=98
  lat (nsec)   : 750=0.32%, 1000=0.38%
  lat (usec)   : 2=1.83%, 4=2.25%, 10=1.91%, 20=1.42%, 50=1.53%
  lat (usec)   : 100=0.35%, 250=6.71%, 500=23.29%, 750=18.99%, 1000=11.89%
  lat (msec)   : 2=18.58%, 4=7.19%, 10=1.95%, 20=0.43%, 50=0.32%
  lat (msec)   : 100=0.04%, 250=0.01%, 500=0.12%, 750=0.47%, 1000=0.03%
  cpu          : usr=1.83%, sys=37.11%, ctx=196666, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.5%, 4=54.1%, 8=40.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.1%, 8=3.9%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,92873,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=3241KiB/s (3318kB/s), 764KiB/s-852KiB/s (783kB/s-873kB/s), io=190MiB (199MB), run=60024-60024msec